# Отчет по лабораторной работе № 12
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Денисов Константин Дмитриевич

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Техника работы с целыми числами
2. **Цель работы**: Составить программу на языке Си в целом типе данных, которая выполняет поставленную задачу для допустимых и корректно записанных чисел
3. **Заданиe**: №25
4. **Протокол**:
```
include <stdio.h>

int main() {                  
    FILE *file;
    file = fopen("numbers.txt", "r+");
    if (file != NULL) {
        int num;
        while (fscanf(file, "%d", &num) == 1) {
            if (num % 2 == 0 && num != 0) {
                num--;
                fseek(file, -1, SEEK_CUR);
                fprintf(file, "%d", num);
            }
            printf("%d ", num);
        }
        fclose(file);
    } 

    return 0;
}
```
5. **Выводы**: В любой серьёзной программе присутствуют числовые вычисления и в сязи с этим было очень интерестно поработать счисловыми данными.
