# Отчет по лабораторной работе № 12
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Денисов Константин Дмитриевич

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Техника работы с целыми числами
2. **Цель работы**: Составить программу на языке Си в целом типе данных, которая выполняет поставленную задачу для допустимых и корректно записанных чисел
3. **Заданиe**: №25
4. **Протокол**:
```
#include <stdio.h>

int main() {
    int number;
    printf("Введите число: ");
    scanf("%d", &number);

    int result = 0;
    int multiplier = 1;
    if (number>0){
        while (number > 0) {
            int digit = number % 10;
            if (digit % 2 == 0) {
                digit -= 1;
            }
            result += digit * multiplier;
            multiplier *= 10;
            number /= 10;
        }
        printf("Результат: %d\n", result);
    }
    else{
        number=-number;
        while (number > 0) {
            int digit = number % 10;
            if (digit % 2 == 0) {
                digit -= 1;
            }
            result += digit * multiplier;
            multiplier *= 10;
            number /= 10;
        }
        printf("Результат: %d\n", -result);
    }


    return 0;
}
```
5. **Выводы**: В любой серьёзной программе присутствуют числовые вычисления и в сязи с этим было очень интерестно поработать счисловыми данными.
