# Отчет по лабораторной работе № 15
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Денисов Константин Дмитриевич

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Техника работы с матрицами
2. **Цель работы**: Составить программу на языке Си для работы с матрицами.
3. **Заданиe**: №21
4. **Протокол**:
```
#include <stdio.h>

void matrix_multiply(int a[2][2], int b[2][2], int result[2][2]) {
    int i, j, k;
    for (i = 0; i < 2; i++) {
        for (j = 0; j < 2; j++) {
            result[i][j] = 0;
            for (k = 0; k < 2; k++) {
                result[i][j] += a[i][k] * b[k][j];
            }
        }
    }
}

int main() {
    int a[2][2] = {{1, 3}, {2, 1}};
    int result[2][2];
    matrix_multiply(a, a, result);
    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 2; j++) {
            printf("%d ", result[i][j]);
        }
        printf("\n");
    }
    return 0;
} 
```
5. **Выводы**: Матрицы очень часто используются для внесения данных по группам и умение пользоваться ими это хороший навык который может пригодиться.