# Отчет по лабораторной работе № 13
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Денисов Константин Дмитриевич

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Техника работы с целыми числами
2. **Цель работы**: Составить программу на языке Си для работы с текстовыми файлами.
3. **Заданиe**: №22
4. **Протокол**:
```
#include <stdio.h>
#include <string.h>
#include <ctype.h>

int main() {
    FILE *file;
    file = fopen("words.txt", "r");

    if (file != NULL) {
        int count = 0;
        char word[50];

        while (fscanf(file, "%s", word) == 1) {
            int consonant_count = 0;
            for (int i = 0; word[i] != '\0'; i++) {
                if (isalpha(word[i]) && !strchr("aeiouAEIOU", word[i])) {
                    consonant_count++;
                }
            }
            if (consonant_count == 1) {
                count++;
            }
        }
        printf("Количество слов с ровно одной согласной буквой: %d\n", count);
        fclose(file);
    }

    return 0;
}

```
5. **Выводы**: Никогда не знаешь когда тебе можнт понадобиться работа с текстом поэтому данная лабораторная работа дала мне новый опыт и знания.

